# GetAllConnectorData Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
DuctFittingAndAccessoryData..::..GetAllConnectorData Method
DuctFittingAndAccessoryData Class See Also
---
Gets the connector data of the pipe fitting or pipe accessory.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public IList<DuctFittingAndAccessoryConnectorData> GetAllConnectorData()
```

Visual Basic
---
```text
Public Function GetAllConnectorData As IList(Of DuctFittingAndAccessoryConnectorData)
```

Visual C++
---
```text
public:
IList<DuctFittingAndAccessoryConnectorData^>^ GetAllConnectorData()
```

# ### Return Value
All connector data.
# Remarks
DuctFittingAndAccessoryConnectorData contains connector data which is needed to calculate coefficient. such as width, height, diameter and flow.
# See Also
DuctFittingAndAccessoryData Class
Autodesk.Revit.DB.Mechanical Namespace